Revit 2027 API
Application Events
The Application type exposes the following members.
Events
Name | Description
ApplicationInitialized |  Subscribe to this event to get notified after the Revit application has been initialized
DocumentChanged |  Subscribe to the DocumentChanged event to be notified when Revit document has changed.
DocumentClosed |  Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
DocumentClosing |  Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
DocumentCreated |  Subscribe to the DocumentCreated event to be notified immediately after Revit has finished creating a new document.
DocumentCreating |  Subscribe to the DocumentCreating event to be notified when Revit is just about to create a new document.
DocumentOpened |  Subscribe to the DocumentOpened event to be notified immediately after Revit has finished opening a document.
DocumentOpening |  Subscribe to the DocumentOpening event to be notified when Revit is just about to open a document.
DocumentPrinted |  Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document.
DocumentPrinting |  Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document.
DocumentReloadedLatest |  Subscribe to the DocumentReloadedLatestEventArgs event to be notified immediately after Revit has finished reloading a document with central model.
DocumentReloadingLatest |  Subscribe to the DocumentReloadingLatestEventArgs event to be notified when Revit is just about to reload latest changes from a central model.
DocumentSaved |  Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document.
DocumentSavedAs |  Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name.
DocumentSaving |  Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document.
DocumentSavingAs |  Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name.
DocumentSynchronizedWithCentral |  Subscribe to the DocumentSynchronizedWithCentral event to be notified immediately after Revit has finished synchronizing a document with central model.
DocumentSynchronizingWithCentral |  Subscribe to the DocumentSynchronizingWithCentral event to be notified when Revit is just about to synchronize a document with central model.
DocumentWorksharingEnabled |  Subscribe to the DocumentWorksharingEnabled event to be notified when a document has become workshared.
ElementTypeDuplicated |  Subscribe to the ElementTypeDuplicated event to be notified immediately after Revit has finished duplicating an element type.
ElementTypeDuplicating |  Subscribe to the ElementTypeDuplicating event to be notified when Revit is just about to duplicate an element type.
FailuresProcessing |  Subscribe to the FailuresProcessing event to be notified when failures are being processed at the end of transaction.
FamilyLoadedIntoDocument |  Subscribe to the FamilyLoadedInto event to be notified after Revit loaded a family into a document.
FamilyLoadingIntoDocument |  Subscribe to the FamilyLoadingInto event to be notified when Revit is just about to load a family into a document.
FileExported |  Subscribe to the FileExported event to be notified immediately after Revit has finished exporting files of formats supported by the API.
FileExporting |  Subscribe to the FileExporting event to be notified when Revit is just about to export files of formats supported by the API.
FileImported |  Subscribe to the FileImported event to be notified immediately after Revit has finished importing a file of format supported by the API.
FileImporting |  Subscribe to the FileImporting event to be notified when Revit is just about to import a file of format supported by the API.
LinkedResourceOpened |  Subscribe to the LinkedResourceOpened event to be notified immediately after Revit has finished opening a linked resource.
LinkedResourceOpening |  Subscribe to the LinkedResourceOpening event to be notified when Revit is just about to open a linked resource.
ProgressChanged |  Subscribe to the ProgressChanged event to be notified when an operation in Revit has progress bar data available.
ViewExported |  Subscribe to the ViewExported event to be notified immediately after Revit has finished exporting a view of the document.
ViewExporting |  Subscribe to the ViewExporting event to be notified when Revit is just about to export a view of the document.
ViewPrinted |  Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document.
ViewPrinting |  Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document.
ViewsExportedByContext |  Subscribe to the ViewsExportedByContext event to be notified immediately after Revit has finished exporting one or more views of the document via an export context by CustomExporter.
ViewsExportingByContext |  Subscribe to the ViewsExportingByContext event to be notified when Revit is just about to export one or more views of the document via an export context by CustomExporter.
WorksharedOperationProgressChanged |  Subscribe to the WorksharedOperationProgressChanged to be notified when progress has changed during Collaboration for Revit's workshared operations: open model and synchronize with central.
Top
See Also
Reference
Application Class
Autodesk.Revit.ApplicationServices Namespace